PLAN FOR: deployments/apiv2/terraform <br /> [0m[1mmodule.mantarray.aws_s3_bucket.logs_bucket: Refreshing state... [id=prod-mantarray-logs][0m
[0m[1mmodule.users.aws_ecr_repository.users_ecr_repo: Refreshing state... [id=users][0m
[0m[1mmodule.mantarray.aws_s3_bucket.main_firmware_bucket: Refreshing state... [id=prod-main-firmware][0m
[0m[1mmodule.mantarray.aws_s3_bucket.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware][0m
[0m[1mmodule.mantarray.aws_ecr_repository.mantarray_ecr_repo: Refreshing state... [id=mantarray][0m
[0m[1mmodule.mantarray.aws_s3_bucket_server_side_encryption_configuration.logs_bucket: Refreshing state... [id=prod-mantarray-logs][0m
[0m[1mmodule.mantarray.aws_s3_bucket_acl.logs_bucket: Refreshing state... [id=prod-mantarray-logs,private][0m
[0m[1mmodule.mantarray.aws_s3_bucket_server_side_encryption_configuration.main_firmware_bucket: Refreshing state... [id=prod-main-firmware][0m
[0m[1mmodule.mantarray.aws_s3_bucket_acl.main_firmware_bucket: Refreshing state... [id=prod-main-firmware,private][0m
[0m[1mmodule.mantarray.aws_s3_bucket_acl.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware,private][0m
[0m[1mmodule.mantarray.aws_s3_bucket_server_side_encryption_configuration.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.mantarray.aws_s3_bucket.logs_bucket[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_bucket" "logs_bucket" {
        [1m[0mid[0m[0m                                   = "prod-mantarray-logs"
      [33m~[0m [0m[1m[0mserver_side_encryption_configuration[0m[0m = [
          [32m+[0m [0m{
              [32m+[0m [0mrule = [
                  [32m+[0m [0m{
                      [32m+[0m [0mapply_server_side_encryption_by_default = [
                          [32m+[0m [0m{
                              [32m+[0m [0mkms_master_key_id = ""
                              [32m+[0m [0msse_algorithm     = "AES256"
                            },
                        ]
                      [32m+[0m [0mbucket_key_enabled                      = false
                    },
                ]
            },
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {}
        [90m# (17 unchanged attributes hidden)[0m[0m
    }

[1m  # module.mantarray.aws_s3_bucket_server_side_encryption_configuration.logs_bucket[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "logs_bucket" {
        [1m[0mid[0m[0m     = "prod-mantarray-logs"
        [90m# (1 unchanged attribute hidden)[0m[0m

      [32m+[0m [0mrule {
          [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m = false

          [32m+[0m [0mapply_server_side_encryption_by_default {
              [32m+[0m [0m[1m[0msse_algorithm[0m[0m = "AES256"
            }
        }
      [31m-[0m [0mrule {
          [31m-[0m [0mapply_server_side_encryption_by_default {
              [31m-[0m [0m[1m[0msse_algorithm[0m[0m = "AES256" [90m->[0m [0m[90mnull[0m[0m
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.mantarray.aws_s3_bucket.channel_firmware_bucket[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_s3_bucket" "channel_firmware_bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m                  = (known after apply)
      [33m~[0m [0m[1m[0macl[0m[0m                                  = "private" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0marn[0m[0m                                  = "arn:aws:s3:::prod-channel-firmware" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mbucket[0m[0m                               = "prod-channel-firmware" [33m->[0m [0m"prod-channel-firmware-test" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mbucket_domain_name[0m[0m                   = "prod-channel-firmware.s3.amazonaws.com" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mbucket_regional_domain_name[0m[0m          = "prod-channel-firmware.s3.us-east-2.amazonaws.com" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcors_rule[0m[0m                            = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mgrant[0m[0m                                = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mhosted_zone_id[0m[0m                       = "Z2O1EMRO9K5GLX" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                                   = "prod-channel-firmware" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlifecycle_rule[0m[0m                       = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlogging[0m[0m                              = [] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                               = (known after apply)
      [33m~[0m [0m[1m[0mregion[0m[0m                               = "us-east-2" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mreplication_configuration[0m[0m            = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mrequest_payer[0m[0m                        = "BucketOwner" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mserver_side_encryption_configuration[0m[0m = [
          [31m-[0m [0m{
              [31m-[0m [0mrule = [
                  [31m-[0m [0m{
                      [31m-[0m [0mapply_server_side_encryption_by_default = [
                          [31m-[0m [0m{
                              [31m-[0m [0mkms_master_key_id = ""
                              [31m-[0m [0msse_algorithm     = "AES256"
                            },
                        ]
                      [31m-[0m [0mbucket_key_enabled                      = false
                    },
                ]
            },
        ] [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                                 = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m                             = {} [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mversioning[0m[0m                           = [
          [31m-[0m [0m{
              [31m-[0m [0menabled    = false
              [31m-[0m [0mmfa_delete = false
            },
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mwebsite[0m[0m                              = [] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m                     = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [32m+[0m [0mobject_lock_configuration {
          [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrule[0m[0m                = (known after apply)
        }
    }

[1m  # module.mantarray.aws_s3_bucket_acl.channel_firmware_bucket[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_s3_bucket_acl" "channel_firmware_bucket" {
      [33m~[0m [0m[1m[0mbucket[0m[0m = "prod-channel-firmware" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m     = "prod-channel-firmware,private" [33m->[0m [0m(known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [33m~[0m [0maccess_control_policy {
          [31m-[0m [0mgrant {
              [31m-[0m [0m[1m[0mpermission[0m[0m = "FULL_CONTROL" [90m->[0m [0m[90mnull[0m[0m

              [31m-[0m [0mgrantee {
                  [31m-[0m [0m[1m[0mid[0m[0m   = "fea27ed68b1178ef354ac7a27d6826e4a54a35dbb79ff6ff4f50f0a57f675b5a" [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0mtype[0m[0m = "CanonicalUser" [90m->[0m [0m[90mnull[0m[0m
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = (known after apply)

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0memail_address[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
                  [32m+[0m [0m[1m[0mtype[0m[0m          = (known after apply)
                  [32m+[0m [0m[1m[0muri[0m[0m           = (known after apply)
                }
            }

          [33m~[0m [0mowner {
              [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
              [33m~[0m [0m[1m[0mid[0m[0m           = "fea27ed68b1178ef354ac7a27d6826e4a54a35dbb79ff6ff4f50f0a57f675b5a" [33m->[0m [0m(known after apply)
            }
        }
    }

[1m  # module.mantarray.aws_s3_bucket_server_side_encryption_configuration.channel_firmware_bucket[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "channel_firmware_bucket" {
      [33m~[0m [0m[1m[0mbucket[0m[0m = "prod-channel-firmware" [33m->[0m [0m"prod-channel-firmware-test" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m     = "prod-channel-firmware" [33m->[0m [0m(known after apply)

      [31m-[0m [0mrule {
          [31m-[0m [0m[1m[0mbucket_key_enabled[0m[0m = false [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0mapply_server_side_encryption_by_default {
              [31m-[0m [0m[1m[0msse_algorithm[0m[0m = "AES256" [90m->[0m [0m[90mnull[0m[0m
            }
        }
      [32m+[0m [0mrule {
          [32m+[0m [0mapply_server_side_encryption_by_default {
              [32m+[0m [0m[1m[0msse_algorithm[0m[0m = "AES256"
            }
        }
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 3 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.